kongyejun/Embedded_system_Lib/STM32ModuleDevelopment/Infrared_time_measurement_RCCTime/Hardware/IR_thru_beam_counter.c
#include "stm32f10x.h"

/*
void EXTI_DeInit(void);----恢复出厂设置
void EXTI_Init(EXTI_InitTypeDef* EXTI_InitStruct);-----初始化EXTI
void EXTI_StructInit(EXTI_InitTypeDef* EXTI_InitStruct);------获取EXTI的结构体参数
void EXTI_GenerateSWInterrupt(uint32_t EXTI_Line);------软件模拟中断
FlagStatus EXTI_GetFlagStatus(uint32_t EXTI_Line);-------查看指定的标志位是否被至1了（可以查看不被允许中断的标志位）
void EXTI_ClearFlag(uint32_t EXTI_Line);------清除指定的标志位
ITStatus EXTI_GetITStatus(uint32_t EXTI_Line);-------查看指定的标志位是否被置1了（查看可以中断的标志位）
void EXTI_ClearITPendingBit(uint32_t EXTI_Line);------清除指定的标志位
*/


//初始化红外计数器
void CountSensor_init(){
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);//开启GPIO外设的时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);//开启AFIO的时钟
	//GPIO初始化
	GPIO_InitTypeDef GPIO_initstruct;
	GPIO_initstruct.GPIO_Mode=GPIO_Mode_IPU;
	GPIO_initstruct.GPIO_Pin=GPIO_Pin_8;//红外计数模块上的DO脚
	GPIO_initstruct.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_initstruct);
	//AFIO通道选择
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB,GPIO_PinSource8);
	//EXTI配置
	EXTI_InitTypeDef EXTI_Initstruct;
	EXTI_Initstruct.EXTI_Line=EXTI_Line8;
	EXTI_Initstruct.EXTI_LineCmd=ENABLE;
	EXTI_Initstruct.EXTI_Mode=EXTI_Mode_Interrupt;
	EXTI_Initstruct.EXTI_Trigger=EXTI_Trigger_Rising_Falling;
	//初始化EXTI
	EXTI_Init(&EXTI_Initstruct);
	//设置NVIC寄存器
	//NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//------------设置分组
	NVIC_InitTypeDef NVIC_InitStruct;
	NVIC_InitStruct.NVIC_IRQChannel=EXTI9_5_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd=ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority=2;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority=2;
	//初始化NVIC
	NVIC_Init(&NVIC_InitStruct);
}


